Revit 2027 API
ParameterTypeId.PropertySegmentBearing Property
 "Bearing"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PropertySegmentBearing { get; }
Public Shared ReadOnly Property PropertySegmentBearing As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PropertySegmentBearing {
	ForgeTypeId^ get ();
}
static member PropertySegmentBearing : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace